---
kind: property
id: P:Autodesk.Revit.DB.Structure.FabricSheet.CutOverallLength
source: html/22fbceb2-729d-6f32-643c-68986ee4fe8d.htm
---
# Autodesk.Revit.DB.Structure.FabricSheet.CutOverallLength Property

The sheet length after cutting has taken place.

## Syntax (C#)
```csharp
public double CutOverallLength { get; }
```